Address 2nd comment regarding the Dynamic Scoring Framework Addon
Signed-off-by: Kazuma Takeuchi <kazuma.takeuchi02@g.softbank.co.jp>
